const year = prompt('Введіть рік народження:');
const city = prompt('Введіть місто проживання:');
const sport = prompt('Введіть ваш улюблений вид спорту:');

let currentYear = 2026;

alert(
  year !== null
    ? `Вам у цьому році ${currentYear - year} років`
    : `Шкода, що Ви не захотіли ввести свій вік`,
);

if (city === 'Київ') {
  alert('Ти живеш у столиці України');
} else if (city === 'Вашингтон') {
  alert('Ти живеш у столиці Сполучених Штатів Америки');
} else if (city === 'Лондон') {
  alert('Ти живеш у столиці Великої Британії');
} else if (!city) {
  alert('Шкода, що Ви не захотіли ввести своє місто');
} else {
  alert(`Ти живеш у місті ${city}`);
}

if (sport === 'футбол') {
  alert('Круто! Хочеш стати як Кріштіану Роналду?');
} else if (sport === 'бокс') {
  alert('Круто! Хочеш стати як Олександр Усик?');
} else if (sport === 'легка атлетика') {
  alert('Круто! Хочеш стати як Сергій Бубка?');
} else if (!sport) {
  alert('Шкода, що Ви не захотіли ввести свій улюблений вид спорту');
} else {
  alert(`${sport} - чудовий вибір для спорту`);
}
